# 1) შექმენით სტრინგების სია და შეინახე სახელები, თუ ამ სიაშია სტრინგი "გიორგი" ამოშალე ის, თუ არაა დააბრუნე სია

        
# 2)შექმენი სია და ამოიღე ბოლო ელემენტი
smth = ["hi","bye","hello","goodbye"]
pop = smth.pop(3)
print(smth)
# 3)სახელების სიაში 2 ინდექსზე ჩაამატე "ალექსანდრე"

name_list = ["გიო","დემე","გიორგი"]
add = name_list.insert(2,"alexandre") 
print(name_list)
# 4)შექმენით სახელების სია, შემდეგ მომხმარებელს შემოტანინეთ მისი სახელი და ჩაამატეთ სიის ბოლოში

name_list2 = ["სანდრო","გიო","გიორგი"]
name = input("Please enter your name: ")
add2 = name_list2.insert(-1, name)
print(name_list2)

# 5)შექმენით რიცხვების სია სადაც იქნება 5 რიცხვი, შემდეგ მომხმარებელს შემოატანინეთ მისი საყვარელი რიცხვი და ასევე ინდექსი, საბოლოოდ ამ შემოტანილ ინდექსზე ჩაამატეთ მისი საყვარელი რიცხვი (შეამოწმეთ რომ ინდექსი იყოს ვალიდური (ანუ არ უნდა ცდებოდეს სიის ინდექსებს (მაგ: თუ სიაში არის მაქსიმალური ინდექსი 5 და მომხმარებელმა შემოიტანა 100, მაშინ დაუპრინტეთ invalid index)))

fav_num = [1,2,3,4,5]
num = int(input("Please enter your num: "))
ind = int(input("Please enter your index: "))
if ind >= 4:
    print("Invalid index")
elif ind < 4:
    add = fav_num.insert(ind, num)
    print(fav_num)

# 6)შექმენით სია, შემდეგ for ციკლი დაატრიალეთ 3-ჯერ და ყოველ ჯერზე სიაში ჩაამატეთ input()

# 7)შექმენით სახელების სია სადაც იქნება 4 ელემენტი, შემდეგ მომხმარებელს შემოატანინეთ ინდექსი და ამ ინდექსზე მდგომი ელემენტი ამოშალეთ სიიდან (შეამოწმეთ რომ ინდექსი იყოს ვალიდური)
name_list3 = ["გიო","გიორგი","დემე","სანდრო"]
ind2 = int(input("Please enter your index: "))
if ind2 > 3:
    print("INVALID INDEX")
elif ind2 <= 3:
    pop = name_list3.pop(ind2)
    print(name_list3)