# 1) ახსენით რა არის ფუნქცია

#fuction - ყველა ფუნქციას გადაეცემა არგუმენტი და ტერმინალში გამოაქვს შედეგი

# 2) შექმენი შენი ფუნქცია სახელად sum_of_3(), რომელსაც გადაეცემა სამი ინტეჯერი და აბრუნებს მათ ჯამს
def sum_of_3(num1,num2,num3):
    print(num1 + num2 + num3)
sum_of_3(10,20,30)

# 3)შექმენი ფუნქცია რომელსაც გადაეცემა სია, შენ უნდა დააბრუნო ამ სიის სიგრძე
list_l = ["hi","hello"]
def len_2(list_name):
    print(len(list_name))
len_2(list_l)
# 4)შექმენით ფუნქცია სახელად average(), რომელსაც გადაეცემა ინტეჯერების სია, შენ უნდა დააბრუნო ამ სიაში არსებული ინტეჯერების საშუალო არითმეტიკული (საშუალო არითმეტიკული გამოითვლება რიცხვების ჯამი/რიცხვების რაოდენობა)

# 5)შექმენით ფუნქცია რომელსაც გადაეცემა სტრინგი და ინტეჯერი, ასევე ფუნქციას ქონდეს სია რომელშიც ჩაამატებ მომხმარებლის შემოტანილ სტრინგს იმ ინდექსზე რომელიც მან შემოიტანა
def list_o(str1,int1):
    list1 = ["hi"]
    list1.insert(int1, str1)
list_o(1,"Hello")
# 6)შექმენით len ფუნქციის იდენტური ვარიანტი

# 7)შექმენით sum ფუნქციის იდენტური ვარიანტი (sum ფუნქციას გადაეცემა ინტეჯერების სია და გამოაქ ამ ინტეჯერების ჯამი)