# 1)კომენტარის სახით ახსენით განსხვავება explicit და implicit data conversion შორის და დაწერე მაგალითები

#explicit - ტიპის შეცვლა ჩვენით
#implicit - ტიპის შეცვლა ავტომატურად (ანუ სისტემის გაკეთებული)

# 2) დაწერეთ მონაცემთა ტიპის შემცვლელი ყველა ფუნქციის მაგალითი

age = int(input("please enter your age: "))
print(age)
print(str(5) + "5")
print(type(float(5)))

# 3)რას გამოიტანს შემდეგი კოდი (შედეგი დაწერე კომენტარის სახით)

# num = 6/2
# print(type(num))

#ეს კოდი float-s გამოიტანს

# 4)დაწერე True იქნება თუ False
# number = 6.0
# number > 6

#ეს კოდი მცდარი იქნება

# 5)დაწერე პროგრამა რომელიც შეასრულებს რიხვების გაყოფას მაგრამ წილადის ნაცვლად ინტეჯერს გამოიტანს

divide = print(10 / 5)
print(int(divide))