# 1) კომენტარის სახით ახსენი რა არის განსხვავება for და while loops შორის
 
#for - მას უთითებ საიდან სადამდე გააკეთოს რამე
#while - მას უთითებ რა გააკეთოს სანამ i ცვლადი არ დაკმაყოფილდება

# 2) გამოიტანეთ რიცხვები 10-დან 38-მდე (for loop)

for i in range(10,38):
    print(i)

# 3) გამოიტანეთ ყველა ლუწი რიცხვი 28-დან 2 ჩათვლით (while loop)

for x in range(28,1,-2):
    print(x)

# 4)გამოიტანეთ ყველა კენტი რიცხვი 100-დან 500-მდე

for i in range(101,500,2):
    print(i)


# 5)გამოიტანეთ შენი სახელის ყველა ასო ცალ-ცალკე

name = "alexandre"

for f in name:
    print(f)

# 6) რას გამოიტანს შემდეგი კოდი (დაწერე პასუხი კომენტარის სახით) :

# while i>10:
#   print("its less")
#   i = i + 1

# ეს კოდი გამოიტანს ერორს რადგან ჩვენ არ ვიცით რა რიცხვი არის დასაწყისში i