# 1)შექმენით სია სადაც გექნებათ 10 რიცხვი, გადაუარეთ ამ სიას და გამოიტანეთ მხოლოდ ის რიცხვები რომელიც მეტია ან ტოლია 10ზე

nums = [1,2,3,4,5,11,12,13,6,14]
for i in nums:
    if i >= 10:
        print(i)

# 2) მომხმარებელს შემოატანინე სახელი და გამოიტანე პირველი და ბოლო ასო

name = input("Please enter your name: ")
print(name[0])
print(name[-1])

# 3)შექმენი სია და შეატრიალე ის

list = ["string", 1, 1.5, True, "string"]
print(list[::-1])

# 4)შემოატანინე მომხმარებელს გვარი და გამიტანე მისი გვარის პირველი 5 ასო შეტრიალებული

surname = input("Please enter your surname: ")
print(surname[-5::-1])

# 5)შექმენი რაიმე სია და მომხმარებელს შემოატანინე n რიცხვი 1-5 დიაპაზონში, შემდეგ კი გამოიტანე ამ სიაში ყველა n რიგის რიცხვი (მაგალითად, სიაში [1,2,3,4,5,6] თუ მომხმარებელმა შემოიტანა 2, შენ გამოიტან [2,4,6])