# 1)შექმენით სია შემდგარი რიცხვებისგან, გადაუარეთ for ციკლით და გამოიტანეთ მხოლოდ ის რიცხვები რომელიც მეტია 10ზე

nums = [34,9,26,3,47]
for i in nums:
    if i > 10:
        print(i)

# 2)შექმენით სია შემდგარი 7 განსხვავებული ემენეტისგან და for ციკლის მეშვეობით შეამოწმეთ თითოეული ემენეტის მონაცემთა ტიპი

elements = ["hello","world",10,10.9,11,True,False]
for i in elements:
    print(type(i))

# 3)შექმენით სია სადაც იქნება 10 რიცხვი და შექმენით sum ცვლადი რომლის საშუალებითაც გამოითვლით ამ ყველა რიცხვის ჯამს.

nums2 = [17,23,19,11,42,53,31,22,29,86]
total = 0
for num in nums2:
    total += num
print(total)

    

# 4) for ციკლის გამოყენებით დაბეჭდე ყველა ელემენტი და მის გვერდით მისი ინდექსი.

words = ["hi","hello","welcome"]
for i in words:
    print(i.index)

# 5) for ციკლით გადაუარე სიას და დაბეჭდე მხოლოდ ის ელემენტები, რომელთა ინდექსი ლუწია.

rando = ["when","was","he","there"]
for i in rando:
    if i.index % 2 == 0:
        print(i)

# 6) შექმენით ინტეჯერების ლისტი, და ორი ცვლადი positive, negative. გამოიტანეთ სიაში არსებული დადებითი რიცხცების ჯამი, უარყოფითები რიცხვების რაოდენობა და დაპრინტე "zero" რამდენჯერაც შეგხვდება 0