# 0) კომენტარის სახით ახსენი ყველა სეტის მეთოდი რაც ვისწავლეთ
#.add() - სეტში ამატებს ელემენტს
#.update() - ანახლებს სეტს
#.remove() - შლის ელემენტს სეტიდან თუ არარსებულ ელემენტს შლი ერორია
#.discard() - იგივე .remove() ერორის გარეშე
#.pop() - შლის რენდომ ელემენტს სეტიდან
#.clear() - ყველა სეტის ელემენტს შლის
#.union() - აერთებს სეტებს
#.intersection() - 2 სეტიდან იღებს დუპლიკატებს და აბრუნებს მათ
#.difference() - 2 სეტიდან იღებს არა დუპლიკატებს და აბრუნებს მათ
#.symetric_difference() - აერთებს 2 სეტს დუპლიკატების გარეშე
# 1)კომენტარის სახით ახსენი განსხვავება discard და remove შორის
#დისქარდი არ აგდებს ერორს არარსებული ელემენტის დროს
# 2)შექმენი სახელების სეტი, სადაც ჩაამატებ სახელ ნიკას, და მოაშორებ სახელ გიორგის (თუ სეტში გიორგი არაა ერორი არ უნდა გამოვიდეს)
names = {"nika","giorgi"}
names.discard("giorgi")
print(names)
# 3)შექმენი ორი მანქანების მოდელების სეტი, და გამოიტანე ის მოდელები რომელიც ორივე სეტშია
models = {"toyota","BMW","chevrolet"}
models2 = {"BMW","Mercedes"}
print(models.intersection(models2))

# 4)შეაერთე შექმნილი მანქანების მოდელების სეტები ერთმანეთთან
print(models.union(models2))
# 5) შექმენი შენი საყვარელი სასმელების სია და წაშალე მათგან რომელიმე
drinks = {"water","nabeRlavi(without gas)","nothing else"}
print(drinks.remove("nothing else"))