# 1)კომენტარებით ახსენით რას აკეთებს str(),int() და float() ფუნქციები.

#str() - აქცევს რაიმე სხვა ტიპის ტექსტს სტრინგად
#int() - აქცევს რაიმე სხვა ტიპის ტექსტს ინტეჯერად
#float() - აქცევს რიცხვითი ტიპის ტექსტს აქცევს მეორე ციფრულ ტექსტად მაგ: 1.0 10.5 და ა.შ.

# 2)შემოიტანეთ თქვენი ოჯახის წევრების ასაკი და დაუპრინტეთ თუ რამდენი წლისები იქნებიან 25 წლის შემდეგ(გამოიყენეთ int ფუნქცია).

age = int(input("Please enter your age: "))
print(age + 25)

# 3)მომხმარებელს შემოატანინეთ მისი სახელი და type ფუნქციის საშუალებით გაიგეთ რა ტიპის მონაცემია შემოტანილი მნიშვნელობა.

name = input("Please enter your name: ")
print(type(name))

# 4)მომხმარებელს შემოატანინეთ მისი ასაკი და შემდეგ გადააქციეთ სტრინგად

enterage = int(input("Please enter your age: "))
print(str(enterage))

# 5) შექმენი ცვლადები სადაც შეინაცავ ყველა შედარების ოპერატორის მაგალითებს 

First = 10 > 5 #True
second = 5 > 10 #False
third = 5 == 5 #True
fourth = 5 == 10 #false

# 6) აუცილებლად შეასრულეთ sololearn

print("OK")