# 1) დაწერე ფუნქცია, რომელიც მიიღებს ერთ რიცხვს და დააბრუნებს მის კვადრატს.
#ვერ მივხვდი რა იგულისხმება კვადრატში(თუ რამე მათემატიკაში არ მაქ გავლილი კვადრატები)
# 2)დაწერე ფუნქცია, ფუნქციამ უნდა დააბრუნოს "ლუწია" ან "კენტია" გადაცემული რიცხვის მიხედვით
def even_odd(number):
    if number % 2 == 0:
        print("even")
    else:
        print("odd")
even_odd(2)
# 3)დაწერე ფუნქცია, ფუნქცია ამოწმებს, არის თუ არა სიტყვა პალინდრომი (მაგ: "level"). (პალინდრომი არის სიტყვა რომელიც წაღმაც და უკუღმაც იგივე გამოდის)
def palindrome(word):
    if word[::-1] == word:
        print(True)
    else:
        print(False)
palindrome("Level")
# 4)დაწერე ფუნქცია, რომელიც დააბრუნებს მხოლოდ ლუწ რიცხვებს ახალი list-ის სახით
def even_odd_list(l):
    for i in l:
        if i % 2 == 0:
            print(i)
even_odd_list([5,2,6,7,0])

# 5) დაწერე ფუნქცია რომელიც იღებს სიტყვების სიას და აბრუნებს ყველაზე გრძელ სიტყვას.
def longest_in_list(lisT):
    for i in lisT:
        if len(i) > i:
            print(i)
longest_in_list(["Hi", "Hello", "bye","Goodbye"])