# 0)კომენტარებით ახსენით სხვაობა სლაისინგსა და ინდექსინგს შორის

# slicing - ისეთი რამ არის რაც გვეხმარება იმ ინდექსების გამოტანაში რომლებიც გვინდა (ბევრი ერთად)
# indexing - ინდექსინგი მხოლოდ 1 ინდექსი გამოაქვს

# 1)შექმენით ცვლადი სადაც შეინახავთ თქვენს გვარს და გამოიტანეთ გვარის ბოლო 5 ასო მინუს ინდექსების გამოყენებით

surname = "gabidzashvili"
print(surname[-9::-1])

# 2)შექმენით სია სადაც იქნება 10 ელემენტი, გამოიტანეთ ჯერ პირველი სამი ელემენტი, შემდეგ ბოლო 4 ელემენტი და ბოლოს შუაში მყოფი ორი ელემენტი

list = ["hi","hello","HI","HELLO","bye","BYE","goodbye","GOODBYE", 5, 10]
print(list[0:3])
print(list[5:10])
print(list[4:6])

# 3)მომხმარებელს შემოატანინეთ თავის გვარი და გამოუტანეთ ეს გვარი შებრუნებულად სლაისინგის გამოყენებით

lastname = input("Please enter your surname: ")
print(lastname[::-1])

# 4)შექმენით ცვლადი სადაც შეინახავთ თქვენი საყვარელი ფილმის სახელს და შემდეგ გამოიტანეთ ამ ფილმის სახელის ყოველი მეორე ასო სლაისინგის გამოყენებით
name = "movie"
print(name[1:2])
print(name[3:4])