# 1) ახსენით რა არის ფუნქცია და არგუმენტი

#function - ფუნქცია ისეთი რამ არის რაც გვეხმარება ნებისმიერი(ზოგჯერ ნებისმმიერი არა) მონაცემთა ტიპის გამოტანას ტერმინალში
#argument - არგუმენტი არის ნებისმიერი რამ ჩაშენებული ფუნქციაში

# 2)რამდენი არგუმენტი გადაეცა პრინტს?
# print("welcome", "hi", range(1,10))
#3

# 3)რატომ გამოაქვს ერორი ამ კოდს
# int = "20"
# print(int + 9)
#იმიტომ რომ ინტ ცვლადი სტრინგს ინახავს სტრინგ + ინტეჯერ = ერორი

# 4)მომხმარებელს შემოატანინე მისი ასაკი და დაუპრინტე მის ასაკზე 10-ით მეტი რიცხვი
age = input("Please enter your age: ")
print(int(age) + 10)