# 1) ახსენით რა განსხვავებაა for და while loops შორის
#while - ისეთი ციკლი სანამ პირობა არ შესრულდება არ შეწყვეტს მოქმედებას
#for - ისეთი ციკლი რომელიც შეგვიძლია გამოვიყენოთ გადასავლებლად ან მივუთითოთ სადამდე ასრულებდეს პირობას
# 2)for loop დახმარებით გამოიტანე სიტყვა "lesson" ყველა სიმბოლო
lesson = "lesson"
for i in lesson:
    print(i)
# 3) while loop დახმარებით გამოიტანე რიცხვები 2-დან 25-ჩათვლით, 3 გამოტოვებით
i = 2
while i < 25:
    print(i)
    i += 3
# 4)შექმენით სია და მომხმარებელს შემოატანინეთ რაიმე სტრინგი, ჩასვი ეს სტრინგი 4 ინდექსზე
list_s = ["hi","hello","bye","goodbye","see you later"]
input_s = input("Please enter a word: ")
list_s.insert(4,input_s)
# 5)შექმენით ინტეჯერების სია და ამოიღეთ სიიდან რიცხვი 24
list_i = [1,10,20,24,15,5,0]
list_i.remove(24)
print(list_i)
# 6) მეოთხე დავალებაში შექმნილი სიიდან ამოიღე 3 ინდექსზე მდგომი ელემენტი
list_s.pop(3)
print(list_s)